# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
from functools import reduce
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

import requests
import pandas as pd
from bs4 import BeautifulSoup



import sys
sys.executable


# Connection Data
driver = 'mysql+pymysql'
ip = '34.65.10.136'

db = 'publications'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
# Engine & Query
engine = create_engine(connection_string)
query = 'SELECT * FROM authors a left join titleauthor ta on a.au_id = ta.au_id'
# Database Request
authors = pd.read_sql(query,engine)

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [2]:
db = 'employees'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
# Engine & Query
engine = create_engine(connection_string)
query = 'SELECT * FROM employees'
# Database Request
employees = pd.read_sql(query,engine)

#### Explore the data types of the `employees` dataframe. Comment your results.

In [4]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
There are 7 (seven) data fields assoicated with each employee record (row). 
There are multiple qualitative fields (i.e. name, department they work within, gender, job title) 
as well as two quantitative (salary and years of service).
"""

#### What's the average salary in this company?

In [6]:
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [7]:
employees["Salary"].max()

70

#### What's the lowest salary?

In [8]:
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [19]:
print(employees[employees.Salary == employees.Salary.min()])

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [30]:
employees.loc[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [31]:
employees['Salary'].loc[employees['Name'] == 'David']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [32]:
employees.loc[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [33]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [35]:
# Method 2
employees.loc[employees.index < 3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [39]:
employees.loc[(employees["Title"] == 'associate') & (employees["Salary"] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [49]:
employees.groupby(['Years'])['Salary'].agg('sum')

Years
1     35
2    115
3     55
4     35
7     60
8    140
Name: Salary, dtype: int64

####  What is the average salary per title?

In [50]:
employees.groupby(['Title'])['Salary'].agg('mean')

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [65]:
employees['Salary'].quantile([.25 ,0.5, 0.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [66]:
employees.groupby(['Gender'])['Salary'].agg('mean')
#Yes, male is 2.5 higher

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [68]:
employees.groupby(['Department'])['Salary','Years'].agg('describe')

           Salary                                                  Years  \
            count   mean        std   min    25%   50%   75%   max count
Department
HR            3.0  45.00  21.794495  30.0  32.50  35.0  52.5  70.0   3.0
IT            4.0  48.75  19.311050  30.0  33.75  47.5  62.5  70.0   4.0
Sales         2.0  55.00   0.000000  55.0  55.00  55.0  55.0  55.0   2.0


                mean       std  min   25%  50%   75%  max
Department
HR          4.666667  3.055050  2.0  3.00  4.0  6.00  8.0
IT          4.500000  3.511885  1.0  1.75  4.5  7.25  8.0
Sales       2.500000  0.707107  2.0  2.25  2.5  2.75  3.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [77]:
df_dpt = employees.agg({'Salary' : [np.min, np.max], 'Years' : [np.min, np.max]})

In [82]:
df_dept = df_dpt.transpose()

In [86]:
df_dept['variance'] = df_dept.apply(lambda x: x['amax'] - x['amin'], axis=1)

In [87]:
df_dept

        amin  amax  variance
Salary    30    70        40
Years      1     8         7

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here